# GetNumLevelTemplates

## Description
Returns the number of story level templates in the file. Story Levels contain a level type, elevation, and optional layer to be used to bound objects on stories; Story Level Templates define a generic level that can be added to multiple stories.

```pascal
FUNCTION GetNumLevelTemplates : INTEGER;
```

```python
def vs.GetNumLevelTemplates():
    return INTEGER
```

## Examples
```pascal
resultN := GetNumLevelTemplates;
```
```python
import vs

# Returns the number of story level templates in the file.
count = vs.GetNumLevelTemplates()
vs.Message('GetNumLevelTemplates returned: ' + str(count))
```

## See Also
VS Functions:
GetLevelTemplateName
| SetLevelTemplateName
| CreateLevelTemplate
| DeleteLevelTemplate
| GetLevelTemplateInfo

## Version
Availability: from Vectorworks 2015

## Category
* Layers